onera_rcf/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//thermoType      ePsiThermo<pureMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>>;

//thermoType      ePsiThermo<pureMixture<sutherlandTransport<specieThermo<eConstThermo<perfectGas>>>>>;
//  thermoType      hePsiThermo<pureMixture<sutherland<eConst<perfectGas<specie>>,sensibleInternalEnergy>>> ;

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland; //const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}


mixture
{
    specie
    {
        nMoles          1;
        molWeight       8314.4621;
    }
    thermodynamics
    {
        Cp              3.5;
        Cv              2.5;
        Hf              0;
    }
    transport
    {
        As              0; 
        Ts              0.412; //120/291.15
        Pr              0.72;
    }
}


// ************************************************************************* //
